Тест/Тест/src/Catalogs/ВыручкаПлан/ВыручкаПлан.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВыручкаПлан</name>
  <attributes>
    <name>ПланВРуб</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>50</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланПроцент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Утверждено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>50</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазницаПлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>50</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Факт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>50</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазницаФакт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>50</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Тест/Тест/src/Catalogs/ВыручкаПлан/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьПодвал();
КонецПроцедуры

Процедура ЗаполнитьПодвал()
	
	//Заполнить подвал Выручка
	Схема = Элементы.Список.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	Настройки = Элементы.Список.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	ЭтотОбъект.ЭтаФорма.Элементы.ПланВРуб.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.ПланПроцент.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.Утверждено.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.РазницаПлан.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.Факт.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.РазницаФакт.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
	
	ЭтотОбъект.ЭтаФорма.Элементы.ПланВРуб.ТекстПодвала =  Формат(Результат.Итог("ПланВРуб"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.ПланПроцент.ТекстПодвала =  Формат(Результат.Итог("ПланПроцент"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.Утверждено.ТекстПодвала =  Формат(Результат.Итог("Утверждено"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.РазницаПлан.ТекстПодвала =  Формат(Результат.Итог("РазницаПлан"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.Факт.ТекстПодвала =  Формат(Результат.Итог("Факт"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.РазницаФакт.ТекстПодвала =  Формат(Результат.Итог("РазницаФакт"),"ЧДЦ=0; ЧН=-");
	
	//Заполнить подвал Расходы
	Схема = Элементы.СписокРасходы.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	Настройки = Элементы.СписокРасходы.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	ЭтотОбъект.ЭтаФорма.Элементы.СписокРасходыПланВРуб.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.СписокРасходыПланПроцент.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.СписокРасходыУтверждено.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.СписокРасходыРазницаПлан.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.СписокРасходыФакт.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.СписокРасходыРазницаФакт.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
	
	ЭтотОбъект.ЭтаФорма.Элементы.СписокРасходыПланВРуб.ТекстПодвала =  Формат(Результат.Итог("ПланВРуб"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.СписокРасходыПланПроцент.ТекстПодвала =  Формат(Результат.Итог("ПланПроцент"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.СписокРасходыУтверждено.ТекстПодвала =  Формат(Результат.Итог("Утверждено"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.СписокРасходыРазницаПлан.ТекстПодвала =  Формат(Результат.Итог("РазницаПлан"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.СписокРасходыФакт.ТекстПодвала =  Формат(Результат.Итог("Факт"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.СписокРасходыРазницаФакт.ТекстПодвала =  Формат(Результат.Итог("РазницаФакт"),"ЧДЦ=0; ЧН=-");
	
КонецПроцедуры
